{
    "name": "Diego Francisco Ferraz Dini",
    "titles": [
        "Desenvolvedor Web FullStack",
        "Especialista em Node.js",
        "Desenvolvedor TypeScript"
    ],
    "biography": "Sou de Piracicaba e, embora tenha começado na mecânica, sempre tive uma paixão pela programação. Meu primeiro projeto foi um bot para Discord usando o framework Discord.js, o que me levou a aprender JavaScript em uma noite e decidir seguir a carreira de programador. Antes de me focar totalmente na programação, trabalhei no setor automotivo, onde adquiri soft skills valiosas e uma visão mais ampla do ambiente corporativo. Agora, busco minha primeira oportunidade como desenvolvedor para aplicar e expandir meus conhecimentos e contribuir com minha paixão e dedicação à área.",
    "soft_skills": [
        "Comunicação eficaz",
        "Trabalho colaborativo",
        "Resolução de problemas",
        "Pensamento crítico"
    ],
    "hard_skills": [
        "JavaScript",
        "TypeScript",
        "Node.js",
        "React",
        "Express",
        "SQL",
        "NoSQL"
    ],
    "projects": [
        {
            "title": "Sistema de Gestão de Tarefas",
            "description": "Desenvolvimento de uma aplicação para gestão de tarefas com funcionalidades de criação, edição e acompanhamento de tarefas, utilizando React no frontend e Node.js no backend.",
            "tags": [
                "React",
                "Node.js",
                "Express",
                "MongoDB"
            ],
            "img_src": "assets/photo.png"
        },
        {
            "title": "Plataforma de E-commerce",
            "description": "Criação de uma plataforma de e-commerce completa, com integração de gateways de pagamento, gerenciamento de inventário e sistema de recomendação, utilizando TypeScript e uma stack fullstack.",
            "tags": [
                "TypeScript",
                "Node.js",
                "Express",
                "PostgreSQL"
            ],
            "img_src": "assets/photo.png"
        },
        {
            "title": "Blog de Tecnologia",
            "description": "Desenvolvimento de um blog focado em tecnologia, com funcionalidades de criação e gestão de posts, comentários e categorias, implementado com React e GraphQL.",
            "tags": [
                "React",
                "GraphQL",
                "Node.js"
            ],
            "img_src": "assets/photo.png"
        },
        {
            "title": "Dashboard de Análise de Dados",
            "description": "Criação de um dashboard interativo para análise de dados, com gráficos e relatórios dinâmicos, utilizando D3.js e Node.js para a parte backend.",
            "tags": [
                "D3.js",
                "Node.js",
                "Express"
            ],
            "img_src": "assets/photo.png"
        },
        {
            "title": "Aplicativo de Chat em Tempo Real",
            "description": "Desenvolvimento de um aplicativo de chat com funcionalidades de mensagens em tempo real, utilizando WebSockets para comunicação instantânea e React no frontend.",
            "tags": [
                "WebSocket",
                "React",
                "Node.js"
            ],
            "img_src": "assets/photo.png"
        },
        {
            "title": "Gerenciador de Projetos Pessoais",
            "description": "Criação de uma ferramenta para gerenciamento de projetos pessoais, com funcionalidades de organização de tarefas, metas e cronogramas, utilizando Vue.js e Firebase.",
            "tags": [
                "Vue.js",
                "Firebase"
            ],
            "img_src": "assets/photo.png"
        },
        {
            "title": "Aplicativo de Reserva de Hotéis",
            "description": "Desenvolvimento de uma aplicação para reserva de hotéis com integração com APIs de terceiros para consulta de disponibilidade e preços, implementado com Angular e Node.js.",
            "tags": [
                "Angular",
                "Node.js",
                "APIs"
            ],
            "img_src": "assets/photo.png"
        }
    ]
}